Reports/СТО_БазовыеРеестрНегативныхОтзывов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>СТО_БазовыеРеестрНегативныхОтзывов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериодаЗакрытияЗадач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонцаПериодаЗакрытияЗадач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдВопроса1</Name>
					<Comment>Если в анкете заполнен Вопрос1 и ответ на вопрос 1, тогда такая анкета должна попадать в отчет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдВопроса2</Name>
					<Comment>Если в анкете заполнен Вопрос2 и ответ на вопрос 2, и этот ответ в диапазоне 1..3,  тогда такая анкета должна попадать в отчет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОтвет_Нет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОтвет_1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОтвет_2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОтвет_3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОтвет_4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьКакHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиОформления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаОформления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Продажи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество автомобилей при продаже автомобилей, при ремонтах - количество часов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точка</Name>
					<Comment>С 05.06.2020 для заказ-нарядов ОУ точка заказ-наряда подменяется точкой машинозаезда, т.к. это могут быть разные точки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время события (совпадает с датой документа - регистратора)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопДата</Name>
					<Comment>Дополнительная дата: для заказ-наряда это дата окончания (закрытия)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Comment>Виды событий: "продажа", "ремонт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Возможен список значений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаОбъекта</Name>
					<Comment>Комлектация/ВидРемонта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Наименование покупателя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента (контрагента)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник, сопровождающий продажу (менеджер, мастер-приемщик и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникГУИД</Name>
					<Comment>ГУИД сотрудника из базы-источника. Для ОУ - это не сотрудник из реализации, а сотрудник из сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДругиеСотрудники</Name>
					<Comment>Сотрудник, сопровождающий продажу (менеджер, мастер-приемщик и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Comment>ГУИД покупателя из базы-источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Для заказ-нарядов новой ОУСТО - дата приемки авто (ЗаказНаряд.ДатаНачалаФакт)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пакет</Name>
					<Comment>Пакет продаж, в который входит данный документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Для новой ОУ СТО - дата окончания факт (ДатаОкончанияФакт)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Наименование контактного лица</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магистральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машинозаезд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаЗаказНаряда</Name>
					<Comment>Истинная точка заказ-наряда, не подменяемая на точку машинозаезда</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗадачиЗвонокЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиЗвонокЛояльности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип задачи</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель задачи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Comment>Другие телефоны контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Comment>Дата постановки задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗакрытия</Name>
					<Comment>Сигнатура звонка закрывшего задачу (если есть linked ID) иначе  телефон оператора закрытия</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Дата до которой необходимо исполнить задачу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеПерезвонить</Name>
					<Comment>Напоминание в часах о необходимости перезвона</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПерезвона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Владелец объекта после события купли-продажи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНедозвонов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Comment>Заметка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СигнатураПродажи</Name>
					<Comment>Сигнатура продажи или сигнатура пакета продажи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/СТО_БазовыеРеестрНегативныхОтзывов/Ext/ObjectModule.bsl
Функция УстановитьНастройки(ОтборПоТочкам = Истина) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиПодразделения.Подразделение.Код КАК Код,
	|	ПользователиПодразделения.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ01
	|ИЗ
	|	Справочник.Пользователи.Подразделения КАК ПользователиПодразделения
	|ГДЕ
	|	ПользователиПодразделения.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Предприятие.Код КАК Код
	|ИЗ
	|	Справочник.Предприятие КАК Предприятие
	|ГДЕ
	|	Предприятие.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТ01.Подразделение
	|			ИЗ
	|				ВТ01)";
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	ДоступныеПодразделенияКоды = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	МассивДоступныхТочекПродаж = Новый Массив();
	
	Если ДоступныеПодразделенияКоды.Количество()>0 Тогда
		Обр = Обработки.НастроечныеТаблицыXMLвУчетнойПолитике.Создать();
		Обр.УстановитьНастройки();
		Обр.Прочитать();
		
		Для Каждого Эл Из ДоступныеПодразделенияКоды Цикл
			Отб = Новый Структура();
			Отб.Вставить("Колонка2", Эл);
			Найденные = Обр.ТЗ.НайтиСтроки(Отб);
			Для Каждого Найденная Из Найденные Цикл
				МассивДоступныхТочекПродаж.Добавить(Найденная.Колонка1);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	//Получи перечень точек оформления, фигуировавших в течении последнего месяца
	//---------------------------------------------------------------------------
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Продажи.Точка КАК ТочкаОформления
	|ИЗ
	|	РегистрСведений.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Вид = &Вид
	|	И Продажи.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаДок, МЕСЯЦ, -3) И &ДатаДок
	|	И 1 = 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Продажи.Точка";
	
	//Если не администратор и не сотрудник контакт-центра, тогда ограничение по точкам
	//---------------------------------------------------------------------------------
	Доступно = Не ПараметрыСеанса.РольДоступнаАдминистратор;
	Доступно = Доступно И МассивДоступныхТочекПродаж.Количество()>0;
	Доступно = Доступно И Не ЗначениеЗаполнено(ЗначенияСервера.ПолучитьКонтактЦентр(ПараметрыСеанса.ТекущийПользователь));
	Доступно = Доступно И ОтборПоТочкам = Истина;
	Если Доступно Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Продажи.Точка В (&ДоступныеТочкиПродажи)");
		Запрос.УстановитьПараметр("ДоступныеТочкиПродажи", МассивДоступныхТочекПродаж);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", "Ремонт авто") ;
	Запрос.УстановитьПараметр("ДатаДок", ТекущаяДата());
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование); 
	Если Рез.Пустой() Тогда
		Возврат ""
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		Новая = ЭтотОбъект.ТочкиОформления.Добавить();
		Новая.ТочкаОформления	= Выб.ТочкаОформления;
		Новая.Отбор				= Истина;
	КонецЦикла;
	//Выбери вопрос 1
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"Довольны ли Вы качеством обслуживания при последнем посещении станции?");
	
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден вопрос № 1");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдВопроса1=Рез.Выгрузить()[0][0];
	
	//Выбери вопрос 1_1
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"Довольны ли Вы качеством обслуживания при последнем посещении станции?");
	
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден вопрос № 1");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдВопроса1=Рез.Выгрузить()[0][0];

	
	//Выбери вопрос 2
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"Достоин ли наш Сервис Вашей рекомендации друзьям и знакомым? Оцените по 5-бальной шкале, где 5 - обязательно порекомендуете, 1 - нет.");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден вопрос № 2");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдВопроса2=Рез.Выгрузить()[0][0];

	//Выбери ответ "нет"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"нет");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""нет "" ");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_Нет=Рез.Выгрузить()[0][0];

	//Выбери ответ "1"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"1");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""1"" ");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_1=Рез.Выгрузить()[0][0];

	//Выбери ответ "2"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"2");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""2"" ");
		Возврат ""
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_2=Рез.Выгрузить()[0][0];
	
	//Выбери ответ "3"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"3");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""3"" ");
		Возврат "";
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_3=Рез.Выгрузить()[0][0];
	
	//Выбери ответ "4"
	//---------------
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыСтрок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыСтрок КАК ИдентификаторыСтрок
	|ГДЕ
	|	ИдентификаторыСтрок.Наименование = &Наименование
	|	И ИдентификаторыСтрок.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", 			"4");
	Рез = ОбщегоНазначения.ВыполнитьЗапрос(Запрос, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Если Рез.Пустой() Тогда
		Сообщить("Не найден ответ ""3"" ");
		Возврат "";
	КонецЕсли;
	ЭтотОбъект.ИдОтвет_4=Рез.Выгрузить()[0][0];

КонецФункции

Функция СформироватьОтчет(ТаблДок, СигнатураПродажи = "") Экспорт
	//Параметр СигнатураПродажи заполнен когда отчет строится из консоли негативных отзывов
	
	ТаблДок.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ЗадачиЗвонокЛояльности.СигнатураПродажи КАК СигнатураЗадачи,
	|	ЗадачиЗвонокЛояльности.Телефон КАК Телефон,
	|	Продажи.Точка КАК Точка,
	|	Продажи.Номер КАК Номер,
	|	Продажи.Дата КАК Дата,
	|	Продажи.КонтактноеЛицо КАК КонтактноеЛицо,
	|	Продажи.Сотрудник КАК Сотрудник,
	|	Продажи.Объект КАК Автомобиль
	|ПОМЕСТИТЬ ВТ01_Задачи
	|ИЗ
	|	РегистрСведений.ЗадачиЗвонокЛояльности КАК ЗадачиЗвонокЛояльности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО ЗадачиЗвонокЛояльности.СигнатураПродажи = Продажи.Сигнатура
	|ГДЕ
	|	ЗадачиЗвонокЛояльности.ДатаЗакрытия МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаПериодаЗакрытияЗадач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКонцаПериодаЗакрытияЗадач, ДЕНЬ)
	|	И ЗадачиЗвонокЛояльности.Тип = ЗНАЧЕНИЕ(Перечисление.ТипЗадачи.ЛояльностьРемонтаАвто)
	|	И Продажи.Точка В(&ТочкиОформления)
	|	И ЗадачиЗвонокЛояльности.ПричинаЗакрытия = """"
	|	И 2 = 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(Анкеты.Период) КАК Период,
	|	Анкеты.Телефон КАК Телефон,
	|	Анкеты.Вопрос КАК Вопрос,
	|	Анкеты.Номер КАК Номер,
	|	ВТ01.СигнатураЗадачи КАК СигнатураЗадачи
	|ПОМЕСТИТЬ ВТ001_СрезПоследнихПоСигнатуре
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК Анкеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ01_Задачи КАК ВТ01
	|		ПО Анкеты.СигнатураЗадачи = ВТ01.СигнатураЗадачи
	|ГДЕ
	|	Анкеты.Период <= КОНЕЦПЕРИОДА(&ДатаКонцаПериодаЗакрытияЗадач, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Анкеты.Телефон,
	|	Анкеты.Вопрос,
	|	Анкеты.Номер,
	|	ВТ01.СигнатураЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АнкетыРасширенные.СигнатураЗадачи КАК СигнатураЗадачи,
	|	АнкетыРасширенные.Вопрос КАК Вопрос,
	|	АнкетыРасширенные.Ответ КАК Ответ,
	|	АнкетыРасширенные.ОтветКомментарий.ПолнаяСтрока КАК ОтветКомментарий,
	|	ВТ01.Телефон КАК Телефон,
	|	ВТ01.Точка КАК Точка,
	|	ВТ01.Номер КАК Номер,
	|	ВТ01.Дата КАК Дата,
	|	ВТ01.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ01.Сотрудник КАК Сотрудник,
	|	ВТ01.Автомобиль КАК Автомобиль
	|ПОМЕСТИТЬ ВТ02_АнкетыЗадачБезФильтраПоВопросам
	|ИЗ
	|	РегистрСведений.АнкетыРасширенные КАК АнкетыРасширенные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ001_СрезПоследнихПоСигнатуре КАК ВТ001
	|		ПО АнкетыРасширенные.Период = ВТ001.Период
	|			И АнкетыРасширенные.Телефон = ВТ001.Телефон
	|			И АнкетыРасширенные.Вопрос = ВТ001.Вопрос
	|			И АнкетыРасширенные.Номер = ВТ001.Номер
	|			И АнкетыРасширенные.СигнатураЗадачи = ВТ001.СигнатураЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ01_Задачи КАК ВТ01
	|		ПО (ВТ01.СигнатураЗадачи = АнкетыРасширенные.СигнатураЗадачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.СигнатураЗадачи КАК СигнатураЗадачи
	|ПОМЕСТИТЬ ВТ03_ОтборПоВопросам
	|ИЗ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам КАК ВТ02_АнкетыЗадачБезФильтраПоВопросам
	|ГДЕ
	|	(ВТ02_АнкетыЗадачБезФильтраПоВопросам.Вопрос В (&Вопрос1, &Вопрос1_1)
	|				И ВТ02_АнкетыЗадачБезФильтраПоВопросам.Ответ = &Ответ_Нет
	|			ИЛИ ВТ02_АнкетыЗадачБезФильтраПоВопросам.Вопрос = &Вопрос2
	|				И ВТ02_АнкетыЗадачБезФильтраПоВопросам.Ответ В (&Ответ1, &Ответ2, &Ответ3, &Ответ4))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Точка КАК Точка,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Номер КАК Номер,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Дата КАК Дата,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Сотрудник КАК Сотрудник,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Автомобиль КАК Автомобиль,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Телефон КАК Телефон,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.СигнатураЗадачи КАК СигнатураЗадачи,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Вопрос КАК Вопрос,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.Ответ КАК Ответ,
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам.ОтветКомментарий КАК ОтветКомментарий
	|ИЗ
	|	ВТ02_АнкетыЗадачБезФильтраПоВопросам КАК ВТ02_АнкетыЗадачБезФильтраПоВопросам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ03_ОтборПоВопросам КАК ВТ03_Отбор
	|		ПО ВТ02_АнкетыЗадачБезФильтраПоВопросам.СигнатураЗадачи = ВТ03_Отбор.СигнатураЗадачи
	|ИТОГИ ПО
	|	Точка,
	|	Номер,
	|	Дата,
	|	Сотрудник,
	|	Автомобиль,
	|	Телефон,
	|	КонтактноеЛицо,
	|	СигнатураЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пакеты.Сигнатура КАК СигнатураМастерПродажи,
	|	Пакеты.Продажа КАК СигнатураПодчиненнойПродажи,
	|	Продажи.Номер КАК Номер,
	|	Продажи.Дата КАК Дата,
	|	Продажи.КонтактноеЛицо КАК КонтактноеЛицо,
	|	Продажи.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ЗадачиЛояльностиПакеты КАК Пакеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ03_ОтборПоВопросам КАК ВТ03_Отбор
	|		ПО Пакеты.Сигнатура = ВТ03_Отбор.СигнатураЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Продажи КАК Продажи
	|		ПО Пакеты.Продажа = Продажи.Сигнатура";
	
	
	СписокВыбранныхТочекОформления = Новый Массив(); 
	Для Каждого Стр из ЭтотОбъект.ТочкиОформления Цикл
		Если Стр.Отбор = Истина Тогда
			СписокВыбранныхТочекОформления.Добавить(Стр.ТочкаОформления);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТочкиОформления", СписокВыбранныхТочекОформления);
	
	Запрос.УстановитьПараметр("ДатаНачалаПериодаЗакрытияЗадач", 	ЭтотОбъект.ДатаНачалаПериодаЗакрытияЗадач);
	Запрос.УстановитьПараметр("ДатаКонцаПериодаЗакрытияЗадач", 		ЭтотОбъект.ДатаКонцаПериодаЗакрытияЗадач);
	Запрос.УстановитьПараметр("Вопрос1", 							ЭтотОбъект.ИдВопроса1);
	Запрос.УстановитьПараметр("Вопрос1_1", 							Анкета.ДовольныЛиВыПоследнимПосещениемСтанции());
	Запрос.УстановитьПараметр("Вопрос2",							ЭтотОбъект.ИдВопроса2);
	Запрос.УстановитьПараметр("Ответ_Нет", 							ЭтотОбъект.ИдОтвет_Нет);
	Запрос.УстановитьПараметр("Ответ1", 							ЭтотОбъект.ИдОтвет_1);
	Запрос.УстановитьПараметр("Ответ2", 							ЭтотОбъект.ИдОтвет_2);
	Запрос.УстановитьПараметр("Ответ3", 							ЭтотОбъект.ИдОтвет_3);
	Запрос.УстановитьПараметр("Ответ4",								ЭтотОбъект.ИдОтвет_4);
	
	
	//Если отчет вызван из консоли негативных отзывов
	//------------------------------------------------
	Если ЗначениеЗаполнено(СигнатураПродажи) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "Продажи.Сигнатура = &СигнатураПродажи");
		
		ТекДата = ТекущаяДата();
		Запрос.УстановитьПараметр("ДатаНачалаПериодаЗакрытияЗадач", 	ДобавитьМесяц(ТекДата, -3));
		Запрос.УстановитьПараметр("ДатаКонцаПериодаЗакрытияЗадач", 		ТекДата);
		Запрос.УстановитьПараметр("СигнатураПродажи",					СигнатураПродажи);
	КонецЕсли;
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	Рез = ПакетРезультатов[4];
	Если Рез.Пустой() Тогда
		Возврат ""; 
	КонецЕсли;
	
	ЗаказНарядыВПакетах = ПакетРезультатов[5].Выгрузить();
	
	
	Макет = ЭтотОбъект.ПолучитьМакет("МакетОтчета");
	
	ВыбТочка = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбТочка.Следующий() Цикл
		ВыбНомер = ВыбТочка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыбНомер.Следующий() Цикл
			ВыбДата = ВыбНомер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыбДата.Следующий() Цикл
				ВыбСотрудник = ВыбДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыбСотрудник.Следующий() Цикл
					ВыбАвтомобиль = ВыбСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыбАвтомобиль.Следующий() Цикл
						ВыбТелефон = ВыбАвтомобиль.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыбТелефон.Следующий() Цикл
							ВыбКонтакт = ВыбТелефон.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыбКонтакт.Следующий() Цикл
								
								ВыбСигнатура = ВыбКонтакт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								Пока ВыбСигнатура.Следующий() Цикл
									ОблШапка = Макет.ПолучитьОбласть("Шапка|Кол1");
									ОблШапка.Вывести(ОблШапка);

									ОблШапка = Макет.ПолучитьОбласть("Шапка|ОсновныеКолонки");
									ОблШапка.Параметры.ПечТочкаОформления = ВыбКонтакт.Точка;
									
									ЗаказНаряды = ВыбКонтакт.Номер+" от "+Формат(ВыбКонтакт.Дата, "ДФ=dd.MM.yyyy");
									Сотрудники  = ВыбКонтакт.Сотрудник;
									
									// Вывод списка заказ-нарядов и сотрудников
									//------------------------------------------
									Отб = Новый Структура();
									Отб.Вставить("СигнатураМастерПродажи", ВыбСигнатура.СигнатураЗадачи);
									Найденные = ЗаказНарядыВПакетах.НайтиСтроки(Отб);
									Для Каждого Стр Из Найденные Цикл
										ЗаказНаряды = ЗаказНаряды+";"+Стр.Номер+" от "+	Формат(Стр.Дата, "ДФ=dd.MM.yyyy");
										
										Если СтрНайти(Сотрудники, Стр.Сотрудник)= 0 Тогда
											Сотрудники = Сотрудники + "; "+Стр.Сотрудник;
										КонецЕсли;
									КонецЦикла;
									ОблШапка.Параметры.ПечНомераДатыЗаказНарядов 	= ЗаказНаряды;
									ОблШапка.Параметры.ПечФИОСотрудников 			= Сотрудники;
									
									
									ОблШапка.Параметры.ПечАвтомобиль				= ВыбКонтакт.Автомобиль;
									ОблШапка.Параметры.ПечТелНомерКонтактногоЛица	= ВыбКонтакт.Телефон;
									ОблШапка.Параметры.ПечФИОКонтактногоЛица		= ВыбКонтакт.КонтактноеЛицо;
									
									ТаблДок.Вывести(ОблШапка);
									
									ВыбДетальные = ВыбСигнатура.Выбрать();
									Пока ВыбДетальные.Следующий() Цикл
										ОблСтр = Макет.ПолучитьОбласть("Строка|Кол1");
										ОблСтр.Вывести(ОблСтр);

										ОблСтр = Макет.ПолучитьОбласть("Строка|ОсновныеКолонки");
										ОблСтр.Параметры.ПечВопрос 				= ВыбДетальные.Вопрос;
										ОблСтр.Параметры.ПечОтвет				= ВыбДетальные.Ответ;
										ОблСтр.Параметры.ПечОтветКомментарий 	= ВыбДетальные.ОтветКомментарий;  
										
										ОблЯчеек = ТаблДок.Вывести(ОблСтр);
										
										// Условное форматирование
										//------------------------
										Доступно = ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_Нет;
										Доступно = Доступно ИЛИ ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_1;
										Доступно = Доступно ИЛИ ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_2;
										Доступно = Доступно ИЛИ ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_3;
										Доступно = Доступно ИЛИ ВыбДетальные.Ответ = ЭтотОбъект.ИдОтвет_4;
										Если Доступно Тогда
												ОблЯчеек.ЦветФона = webцвета.БледноБирюзовый;	
										КонецЕсли;

									КонецЦикла;
								КонецЦикла;
								
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
КонецФункции
